var to_city_map_data=[{
  'name': '1号线方庄线',
  'color': '#9B9B9B',
  'id': '15',
  'lineOl':'1',
  'stations': [{
    'start':'1',
    'sxy':'2216.61,1578.2',
    'pxy':'2240.61,1578.2',
    'ol':'1',
    'id': '70',
    'transfer': false,
    'xy': '2009.61,1655.2',
    'point_xy': '2238.30,1686.63',
    "draw_args": 'L2238.30,1686.63L2238.30,1686.63L2360.91,1686.63',//L2360.91,1686.63L2560.91,602.63
    'name': '方庄环岛站',
    '_name':'fangzhuanghuandaozhan'
  }, {
    'ol':'2',
    'id': '69',
    'transfer': false,
    'xy': '2290.91,1636.63',
    'point_xy': '2360.91,1686.63',
    'draw_args': 'L2360.91,1686.63L2560.91,1686.63L2560.91,1560.63',
    'name': '方庄桥站',
    '_name':'fangzhuangqiaozhan'
  }
  , {
    'ol':'3',
    'id': '68',
    'transfer': false,
    'xy': '2595.09,1560.63',
    'point_xy': '2560.91,1560.63',
    'draw_args': 'L2560.91,1560.63L2560.91,1450.63',
    'name': '十里河站'
    ,"_name":"shilihezhan"
  }, {
    'ol':'4',
    'id': '67',
    'transfer': false,
    'xy': '2595.09,1450.63',
    'point_xy': '2560.91,1450.63',
    'draw_args': 'L2560.91,1450.63L2560.91,1200.63',
    'name': '潘家园站'
    ,"_name":"panjiayuanzhan"

    }, {
    'ol':'5',
    'id': '66',
    'transfer': false,
    'xy': '2595.09,1200.63',
    'point_xy': '2560.91,1200.63',
    'draw_args': 'L2560.91,1200.63L2560.91,1000.63',
    'name': '国贸站'
    ,"_name":"guomaozhan"

    }, {
    'ol':'6',
    'id': '65',
    'transfer': false,
    'xy': '2595.09,1000.63',
    'point_xy': '2560.91,1000.63',
    'draw_args': 'L2560.91,1000.63L2560.91,750.63',
    'name': '白家庄站'
    ,"_name":"baijiazhuangzhan"

    }, {
    'ol':'7',
    'id': '64',
    'transfer': false,
    'xy': '2595.09,750.63',
    'point_xy': '2560.91,750.63',
    'draw_args': 'L2560.91,750.63L2560.91,600.63',
    'name': '亮马桥站'
    ,"_name":"liangmaqiaozhan"
    }, {
    'ol':'8',
    'id': '63',
    'transfer': false,
    'xy': '2595.09,600.63',
    'point_xy': '2560.91,600.63',
    'draw_args': 'L2560.91,600.63L2560.91,520.63L2560.91,502.63Q2500.91,462.63,2491.89,473.27Q2491.89,473.27,2956.87,221.42L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '三元桥站'
    ,"_name":"sanyuanqiaozhan"

    }, {
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
  'point_xy': '3010.02,100.93',
  'draw_args': '',
  'name': '首都机场'
    }]
},{
  'name': '2号线北京南站线',
    'color': '#FF3244',
    'id': '16',
    'lineOl':'2',
    'stations': [{
    'start':'2',
    'sxy':'1436.81,1668.23',
    'pxy':'1460.81,1668.23',
    'ol':'1',
    'id': '74',
    'transfer': false,
    'xy': '1500.81,1600.23',
    'point_xy': '1459.81,1600.23',
    "draw_args": 'L1459.81,1600.23L1459.81,1600.23L1459.81,1460',//Q1426.2800000000007,1185.5899999999999,1426.28,1164.27Q1426.2800000000007,1085.5899999999999,1316.89,964.27Q1306.89,954,1309.89,850.27L1309.89,780
    'name': '北京南站'
    ,"_name":"beijingnanzhan"

    }, {
    'ol':'2',
    'id': '73',
    'transfer': false,
    'xy': '1500.81,1460',
    'point_xy': '1459.81,1460',
    "draw_args": 'L1459.81,1460L1459.81,1380L1459.81,1300',
    'name': '自新路口北'
    ,"_name":"zixinlukoubei"

    }, {
    'ol':'3',
    'id': '72',
    'transfer': false,
    'xy': '1500.81,1300',
    'point_xy': '1459.81,1300',
    "draw_args": 'L1459.81,1300L1459.81,1250',
    'name': '宣武门'
    ,"_name":"xuanwumenzhan"


    }, {
    'ol':'4',
    'id': '71',
    'transfer': false,
    'xy': '1400.81,1200',
    'point_xy': '1459.81,1250',
    'draw_args': 'L1459.81,1250L2460.81,1250Q2460.89,730,2456.89,720Q2456.89,720,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '西单站'
    ,"_name":"xidanzhan"

    }, {
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
    }]
},{
  'name': '3号线北京站线',
    'color': '#FFC72C',
    'id': '17',
    'lineOl':'3',
    'stations': [{
    'start':'3',
      'sxy':'2061.81,1310.23',
      'pxy':'2075.81,1330.23',
    'ol':'1',
    'id': '80',
    'transfer': false,
    'xy': '2169.81,1300.23',
    'point_xy': '2139.81,1300.23',
    "draw_args": 'L2139.81,1300.23L2139.81,1200.23L2240.81,1200.23',//Q1426.2800000000007,1185.5899999999999,1426.28,1164.27Q1426.2800000000007,1085.5899999999999,1316.89,964.27Q1306.89,954,1309.89,850.27L1309.89,780
    'name': '北京站'
    ,"_name":"beijingzhan"

    },{
    'ol':'2',
    'id': '79',
    'transfer': false,
    'xy': '2280.81,1200.23',
    'point_xy': '2240.81,1200.23',
    'draw_args': 'L2240.81,1200.23L2250.81,1140.23',
    'name': '国际饭店站'
    ,"_name":"guojifandianzhan"

    }, {
    'ol':'3',
    'id': '78',
    'transfer': false,
    'xy': '2280.81,1090.23',
    'point_xy': '2250.81,1090.23',
    'draw_args': 'L2250.81,1080.23L2250.81,1080.23',
    'name': '雅宝路站'
    ,"_name":"yabaoluzhan"


    },{
    'ol':'4',
    'id': '77',
    'transfer': false,
    'xy': '2280.81,1000',
    'point_xy': '2250.81,1000',
    'draw_args': 'L2250.81,1000.23L2250.81,990.23',
    'name': '朝阳门站'
    ,"_name":"chaoyangmenzhan"


    },{
    'ol':'5',
    'id': '76',
    'transfer': false,
    'xy': '2280.81,910',
    'point_xy': '2250.81,910',
    'draw_args': 'L2250.81,910.23L2250.81,910L2350.81,860',
    'name': '东四十条站'
    ,"_name":"dongsishitiaozhan"

    },{
    'ol':'6',
    'id': '75',
    'transfer': false,
    'xy': '2380.81,860',
    'point_xy': '2350.81,860',
    'draw_args': 'L2350.81,860Q2460.89,730,2456.89,720Q2456.89,720,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2950.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '东直门站'
    ,"_name":"dongzhimenzhan"

    },{
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '4号线公主坟线',
    'color': '#01A64F',
    'id': '18',
    'lineOl':'4',
    'stations': [{
    'start':'4',
    'sxy':'1036.81,1246',
    'pxy':'1060.81,1246',
    'ol':'1',
    'id': '90',
    'transfer': false,
    'xy': '1089.81,1180',
    'point_xy': '1059.81,1180',
    "draw_args": 'L1059.81,1180L1059.81,1080',
    'name': '公主坟站'
    ,"_name":"gongzhufenzhan"

    }, {
    'ol':'2',
    'id': '89',
    'transfer': false,
    'xy': '1092.81,1080',
    'point_xy': '1059.81,1080',
    "draw_args": 'L1059.81,1080L1059.81,980',
    'name': '航天桥站'
    ,"_name":"hangtianqiaozhan"

    }, {
    'ol':'3',
    'id': '88',
    'transfer': false,
    'xy': '1092.81,980',
    'point_xy': '1059.81,980',
    "draw_args": 'L1059.81,980L1059.81,850Q1120.81,750,1200.81,790',
    'name': '紫竹桥站'
    ,"_name":"zizhuqiaozhan"

    }, {
    'ol':'4',
    'id': '87',
    'transfer': false,
    'xy': '1150.81,840',
    'point_xy': '1200.81,790',
    "draw_args": 'L1200.81,790L1350.81,790',
    'name': '友谊宾馆站'
    ,"_name":"youyibingguanzhan"


    }, {
    'ol':'5',
    'id': '86',
    'transfer': false,
    'xy': '1250.81,730',
    'point_xy': '1350.81,790',
    "draw_args": 'L1350.81,790L1450.81,790',
    'name': '蓟门桥站'
    ,"_name":"jimenqiaozhan"

    }, {
    'ol':'6',
    'id': '85',
    'transfer': false,
    'xy': '1390.81,840',
    'point_xy': '1450.81,790',
    "draw_args": 'L1450.81,790L1650.81,790',
    'name': '北太平庄站'
    ,"_name":"beitaipingzhuangzhan"

    }, {
    'ol':'7',
    'id': '84',
    'transfer': false,
    'xy': '1550.81,730',
    'point_xy': '1650.81,790',
    "draw_args": 'L1650.81,790L1900.81,790',
    'name': '马甸桥站'
    ,"_name":"madianqiaozhan"

    }, {
    'ol':'8',
    'id': '83',
    'transfer': false,
    'xy': '1800.81,730',
    'point_xy': '1900.81,790',
    "draw_args": 'L1900.81,790L2250.81,790',
    'name': '安贞桥站',
    "_name":"anzhenqiaozhan"


    }, {
    'ol':'9',
    'id': '82',
    'transfer': false,
    'xy': '2030.81,740',
    'point_xy': '2250.81,790',
    'draw_args': 'L2250.81,790Q2250.81,790,2356.89,750',
    'name': '西坝河站'
    ,"_name":"xibahezhan"

    }, {
    'ol':'10',
    'id': '81',
    'transfer': false,
    'xy': '2186.89,710',
    'point_xy': '2356.89,750',
    'draw_args': 'L2356.89,750Q2460.89,730,2456.89,720Q2456.89,720,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '三元西桥站'
    ,"_name":"sanyuanxiqiaozhan"

    }, {
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '5号线中关村线',
    'color': '#00B9FF',
    'id': '19',
    'lineOl':'5',
    'stations': [{
    'start':'5',
    'sxy':'2226.81,560',
    'pxy':'2240.81,560',
    'ol':'1',
    'id': '96',
    'transfer': false,
    'xy': '920.81,530',
    'point_xy': '1200.81,550',
    "draw_args": 'L1200.81,550L1200.81,610',
    'name': '清华科技园站'
    ,"_name":"qinghuakejiyuanzhan"

    },{
    'ol':'2',
    'id': '95',
    'transfer': false,
    'xy': '920.81,595',
    'point_xy': '1200.81,610',
    "draw_args": 'L1200.81,610L1450.81,610',
    'name': '保福寺桥北站'
    ,"_name":"baofusiqiaobeizhan"

    },{
    'ol':'3',
    'id': '94',
    'transfer': false,
    'xy': '1350.81,560',
    'point_xy': '1450.81,610',
    "draw_args": 'L1450.81,610L1900.81,610',
    'name': '学院桥站'
    ,"_name":"xueyuanqiaozhan"


    },{
    'ol':'4',
    'id': '93',
    'transfer': false,
    'xy': '1700.81,560',
    'point_xy': '1900.81,610',
    "draw_args": 'L1900.81,610L2150.81,610',
    'name': '亚运村站(安慧桥)'
    ,"_name":"yayuncunzhan(anhuiqiao)"

    }, {
    'ol':'5',
    'id': '92',
    'transfer': false,
    'xy': '2050.81,560',
    'point_xy': '2150.81,610',
    "draw_args": 'L2150.81,610L2280.81,610',
    'name': '小营站'
    ,"_name":"xiaoyingzhan"

    }, {
    'ol':'6',
    'id': '91',
    'transfer': false,
    'xy': '2280.81,560',
    'point_xy': '2280.81,610',
    'draw_args': 'L2280.81,610Q2280.81,610,2400.89,700Q2460.89,700,2456.89,660Q2456.89,720,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '望和桥站'
    ,"_name":"wangheqiaozhan"


    }, {
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '6号线上地线',
    'color': '#0077D4',
    'id': '20',
    'lineOl':'6',
    'stations': [{
    'start':'6',
    'sxy':'814.81,450',
    'pxy':'828.81,450',
    'ol':'1',
    'id': '104',
    'transfer': false,
      'xy': '845.81,400',
      'point_xy': '910.81,450',
      "draw_args": 'L910.81,450L1160.81,450',
    'name': '上地站'
    ,"_name":"shangdizhan"

    },{
    'ol':'2',
    'id': '103',
    'transfer': false,
    'xy': '1000.81,400',
    'point_xy': '1160.81,450',
    "draw_args": 'L1160.81,450L1300.81,450',
    'name': '亚奥国际酒店站'
    ,"_name":"yaaoguojijiudianzhan"


    },{
    'ol':'3',
    'id': '102',
    'transfer': false,
    'xy': '1250.81,500',
    'point_xy': '1300.81,450',
    "draw_args": 'L1300.81,450L1540.81,450',
    'name': '奥运村站'
    ,"_name":"aoyuncunzhan"

    },{
    'ol':'4',
    'id': '101',
    'transfer': false,
    'xy': '1500.81,500',
    'point_xy': '1540.81,450',
    "draw_args": 'L1540.81,450L1650.81,450L1690.81,450',
    'name': '大屯'
    ,"_name":"datun"

    },{
    'ol':'5',
    'id': '100',
    'transfer': false,
    'xy': '1550.81,400',
    'point_xy': '1690.81,450',
    "draw_args": 'L1690.81,450L1890.81,450',//L1790.81,500L2130.81,530
    'name': '北苑路大屯东站'
    ,"_name":"beiyuanludatundongzhan"


    },{
    'ol':'6',
    'id': '99',
    'transfer': false,
    'xy': '1850.81,400',
    'point_xy': '1890.81,450',
    "draw_args": 'L1890.81,450L2090.81,450',
    'name': '湖光中街'
    ,"_name":"huguangzhongjie"


    },{
    'ol':'7',
    'id': '98',
    'transfer': false,
    'xy': '1990.81,500',
    'point_xy': '2090.81,450',
    "draw_args": 'L2090.81,450L2290.81,450',
    'name': '广顺北大街'
    ,"_name":"guangshunbeidajie"

    },{
    'ol':'8',
    'id': '97',
    'transfer': false,
    'xy': '2190.81,400',
    'point_xy': '2290.81,450',
    "draw_args": 'L2290.81,450L2538.81,450L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '广顺桥南'
    ,"_name":"guangshunqiaonan"

    },{
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '7号线西客站线',
  'color': '#6B3F97',
  'id': '21',
  'lineOl':'7',
  'stations': [{
    'start':'7',
    'sxy':'1016.81,1380',
    'pxy':'1030.81,1390',
    'ol':'1',
    'id': '110',
    'transfer': false,
    'xy': '1020.81,1330',
    'point_xy': '1100.81,1380',
    "draw_args": 'L1100.81,1380L1260.81,1380',//Q1426.2800000000007,1185.5899999999999,1426.28,1164.27Q1426.2800000000007,1085.5899999999999,1316.89,964.27Q1306.89,954,1309.89,850.27L1309.89,780
    'name': '北京西站南广场站'
    ,"_name":"beijingxizhannanguangchangzhan"

  }, {
    'ol':'2',
    'id': '109',
    'transfer': false,
    'xy': '1190.81,1430.23',
    'point_xy': '1260.81,1380',
    "draw_args": 'L1260.81,1380L1489.81,1380',
    'name': '广安门外',
    "_name":"guanganmenwai"

  }, {
    'ol':'3',
    'id': '108',
    'transfer': false,
    'xy': '1510.81,1420',
    'point_xy': '1489.81,1380',
    "draw_args": 'L1489.81,1380L1759.81,1380',
    'name': '菜市口站'
    ,"_name":"caishikouzhan"

  }, {
    'ol':'4',
    'id': '107',
    'transfer': false,
    'xy': '1709.81,1330.23',
    'point_xy': '1759.81,1380',
    "draw_args": 'L1759.81,1380L1959.81,1380',
    'name': '前门大街南口站'
    ,"_name":"qianmendajienankouzhan"

  }, {
    'ol':'5',
    'id': '106',
    'transfer': false,
    'xy': '1859.81,1430.23',
    'point_xy': '1959.81,1380',
    "draw_args": 'L1959.81,1380L2159.81,1380',
    'name': '磁器口站'
    ,"_name":"ciqikouzhan"

  }, {
    'ol':'6',
    'id': '105',
    'transfer': false,
    'xy': '2059.81,1430.23',
    'point_xy': '2159.81,1380',
    "draw_args": 'L2159.81,1380L2410.89,1380Q2450.89,1370,2460.89,1310Q2460.89,730,2456.89,720Q2456.89,720,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '广渠门站'
    ,"_name":"guangqumenzhan"

  }, {
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '8号线回龙观线',
    'color': '#FF0096',
    'id': '22',
    'lineOl':'8',
    'stations': [{
    'start':'8',
    'sxy':'1204.81,250',
    'pxy':'1218.81,270',
    'ol':'1',
    'id': '117',
    'transfer': false,
    'xy': '1150.81,210',
    'point_xy': '1300.81,280',
    "draw_args": 'L1300.81,280L1500.81,280',
    'name': '回龙观站(龙泽)'
      ,"_name":"huilongguanzhan(longze)"

    },{
    'ol':'2',
    'id': '116',
    'transfer': false,
    'xy': '1300.81,330',
    'point_xy': '1500.81,280',
    "draw_args": 'L1500.81,280L1700.81,280',
    'name': '回龙观西大街站(龙华园)'
    ,"_name":"huilongguanxidajiezhan(longhuayuan)"

    },{
    'ol':'3',
    'id': '115',
    'transfer': false,
    'xy': '1630.81,230',
    'point_xy': '1700.81,280',
    "draw_args": 'L1700.81,280L1900.81,280',
    'name': '万意百货站'
    ,"_name":"wanhuibaihuozhan"

    },{
    'ol':'4',
    'id': '114',
    'transfer': false,
    'xy': '1760.81,330',
    'point_xy': '1900.81,280',
    "draw_args": 'L1900.81,280L2100.81,280',
    'name': '回龙观东大街站(矩阵小区)'
    ,"_name":"huilongguandongdajiezhan(juzhenxiaoqu)"

    },{
    'ol':'5',
    'id': '113',
    'transfer': false,
    'xy': '1980.81,230',
    'point_xy': '2100.81,280',
    "draw_args": 'L2100.81,280L2300.81,280',
    'name': '温都水城站'
    ,"_name":"wendushuichengzhan"

    },{
    'ol':'6',
    'id': '112',
    'transfer': false,
    'xy': '2200.81,230',
    'point_xy': '2300.81,280',
    "draw_args": 'L2300.81,280L2500.81,280',
    'name': '名流花园站'
    ,"_name":"mingliuhuayuanzhan"

    },{
    'ol':'7',
    'id': '111',
    'transfer': false,
    'xy': '2480.81,230',
    'point_xy': '2500.81,280',
    "draw_args": 'L2500.81,280L2650.81,280Q2660.81,280,2680.81,320Q2700.81,330,2750.81,335L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '未来科技城站'      ,"_name":"weilaikejichengzhan"

    },{
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '9号线通州线',
  'color': '#8ED235',
  'id': '23',
  'lineOl':'9',
  'stations': [{
    'start':'9',
    'sxy':'3041.02,1586.63',
    'pxy':'3065.02,1586.63',
    'ol':'1',
    'id': '123',
    'transfer': false,
    'xy': '3090.02,1500.63',
    'point_xy': '3060.02,1500.63',
    "draw_args": 'L3060.02,1500.63L3060.02,1366.63',
    'name': '亚太花园酒店站'      ,"_name":"yataihuayuanjiudianzhan"

  }, {
    'ol':'2',
    'id': '122',
    'transfer': false,
    'xy': '3090.02,1399.63',
    'point_xy': '3060.02,1366.63',
    "draw_args": 'L3060.02,1366.63L3060.02,1126.63',
    'name': '太阳花酒店站'      ,"_name":"taiyanghuajiudianzhan"

  }, {
    'ol':'3',
    'id': '121',
    'transfer': false,
    'xy': '3090.02,1126.63',
    'point_xy': '3060.02,1126.63',
    "draw_args": 'L3060.02,1126.63L3060.02,1006.63',
    'name': '翠屏北里站'      ,"_name":"cuipingbeilizhan"

  }, {
    'ol':'4',
    'id': '120',
    'transfer': false,
    'xy': '3090.02,1006.63',
    'point_xy': '3060.02,1006.63',
    "draw_args": 'L3060.02,1006.63L3060.02,736.63',
    'name': '通州北苑站'      ,"_name":"tongzhoubeiyuanzhan"

  },{
    'ol':'5',
    'id': '119',
    'transfer': false,
    'xy': '3090.02,836.63',
    'point_xy': '3060.02,836.63',
    "draw_args": 'L3060.02,836.63L3060.02,736.63',
    'name': '西大街站'      ,"_name":"xidajiezhan"

  },{
    'ol':'6',
    'id': '118',
    'transfer': false,
    'xy': '3090.02,736.63',
    'point_xy': '3060.02,736.63',
    "draw_args": 'L3060.02,736.63L3060.02,200.93Q3000.5,60.93,3015.5,100.34',//L2360.91,1686.63L2560.91,602.63
    'name': '北关站'      ,"_name":"beiguanzhan"

  },{
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
//   'name': '12号线四惠线',         //12号线暂时保留
//     'color': '#760808',
//     'id': '24',
//     'lineOl':'12',
//     'stations': [{
//     'start':'12',
//     'sxy':'2982.02,1316.63',
//     'pxy':'3012.02,1316.63',
//     'ol':'1',
//     'id': '127',
//     'transfer': false,
//     'xy': '2725.02,1216.63',
//     'point_xy': '3010.02,1246.63',
//     "draw_args": 'L3010.02,1246.63L3010.02,1046.63',
//     'name': '四惠交通枢纽'      ,"_name":"sihuijiaotongshuniu"
//
//     }, {
//     'ol':'2',
//     'id': '126',
//     'transfer': false,
//     'xy': '2780.02,1046.63',
//     'point_xy': '3010.02,1046.63',
//     "draw_args": 'L3010.02,1046.63L3010.02,886.63',
//     'name': '八里庄石佛营站'      ,"_name":"balizhuangnanli"
//
//     },{
//     'ol':'3',
//     'id': '125',
//     'transfer': false,
//     'xy': '2705.02,886.63',
//     'point_xy': '3010.02,886.63',
//     "draw_args": 'L3010.02,886.63L3010.02,786.63',
//     'name': '青年路(大悦城)'      ,"_name":"qingnianlu(dayuecheng)"
//
//     },{
//     'ol':'4',
//     'id': '124',
//     'transfer': false,
//     'xy': '2745.02,786.63',
//     'point_xy': '3010.02,786.63',
//     "draw_args": 'L3010.02,786.63L3010.02,100.93',//L2360.91,1686.63L2560.91,602.63
//     'name': '管庄站(常营)'      ,"_name":"guanzhuangzhan(changying)"
//
//     },{
//     'ol':'100000',
//     'id': '62',
//     'xy': '3045.5,100.34',
//     'point_xy': '3010.02,100.93',
//     'draw_args': '',
//     'name': '首都机场'
//   }]
// },{
  'name': '10号线王府井金宝街线',
  'color': '#FF94C5',
  'id': '25',
  'lineOl':'10',
  'stations': [{
    'start':'10',
    'sxy':'2170.81,902.23',
    'pxy':'2198.81,902.23',
    'ol':'4',
    'id': '131',
    'transfer': false,
    'xy': '1860.81,867.23',
    'point_xy': '2090.81,867.23',
    "draw_args": 'L2090.81,876.23L2090.81,876.23',
    'name': '华侨大厦站',
    '_name':'huaqiaodashazhan'
  },{
    'ol':'3',
    'id': '130',
    'transfer': false,
    'xy': '1780.81,950.23',
    'point_xy': '2090.81,950.23',
    "draw_args": 'L2090.81,950.23L2090.81,1160.23',
    'name': '天伦王朝酒店站',
    '_name':'tianlunwangchaojiudianzhan'
  },{
    'ol':'2',
    'id': '129',
    'transfer': false,
    'xy': '1700.81,1020.23',
    'point_xy': '2090.81,1020.23',
    "draw_args": 'L2090.81,1020.23L2090.81,1150.23',
    'name': '金鱼胡同和平宾馆站',
    '_name':"jinyuhutonghepingbinguanzhan"

  },{
    'ol':'1',
    'id': '128',
    'transfer': false,
    'xy': '1900.81,1100.23',
    'point_xy': '2090.81,1150.23',
  // "draw_args": 'L1780.81,1160.23Q1830.89,960,2456.89,750Q2456.89,750,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    "draw_args": 'L2090.81,1150L2410.89,1150Q2450.89,1150,2460.89,1150Q2460.89,730,2456.89,720Q2456.89,720,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '金宝街丽晶酒店',
    '_name':'jinbaojielijingjiudian'
  },
    // {
  //   'ol':'2',
  //   'id': '129',
  //   'transfer': false,
  //   'xy': '1830.81,1210.23',
  //   'point_xy': '2160.81,1160.23',
  //   "draw_args": 'L2160.81,1160.23L2160.81,1100.23',
  //   'name': '金鱼胡同和平宾馆站'
  // },{
  //   'ol':'3',
  //   'id': '130',
  //   'transfer': false,
  //   'xy': '1840.81,1090.23',
  //   'point_xy': '2160.81,1100.23',
  //   "draw_args": 'L2160.81,1100.23L2160.81,1000.23',
  //   'name': '天伦王朝酒店站'
  // },{
  //   'ol':'4',
  //   'id': '131',
  //   'transfer': false,
  //   'xy': '1920.81,1000.23',
  //   'point_xy': '2160.81,1000.23',
  //   "draw_args": 'L2160.81,1000.23Q2460.89,730,2456.89,720Q2456.89,720,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
  //   'name': '华侨大厦站'
  // },
    {
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '16号线石景山线',
  'color': '#F48C4F',
  'id': '26',
  'lineOl':'16',
  'stations': [{
    'start':'16',
    'sxy':'150.81,1180',
    'pxy':'180.81,1180',
    'ol':'1',
    'id': '135',
    'transfer': false,
    'xy': '139.81,1110',
    'point_xy': '259.81,1180',
    "draw_args": 'L259.81,1180L500.81,1180',
    'name': '石景山(万商花园酒店)'      ,"_name":"shijingzhan(wanshanghuayuanjiudian)"

  },{
    'ol':'2',
    'id': '134',
    'transfer': false,
    'xy': '360.81,1245',
    'point_xy': '500.81,1180',
    "draw_args": 'L500.81,1180L759.81,1180',
    'name': '万达嘉华酒店站'      ,"_name":"wandajiahuajiudianzhan"

  },{
    'ol':'3',
    'id': '133',
    'transfer': false,
    'xy': '709.81,1245',
    'point_xy': '759.81,1180',
    "draw_args": 'L759.81,1180L759.81,980',
    'name': '鲁谷站(远洋山水)'      ,"_name":"luguzhan(yuanyangshanshui)"

  },{
    'ol':'4',
    'id': '132',
    'transfer': false,
    'xy': '789.81,980',
    'point_xy': '759.81,980',
    "draw_args": 'L759.81,980L759.81,700Q769.81,660,789.81,650L2280.81,650Q2280.81,650,2400.89,700Q2460.89,700,2456.89,660Q2456.89,720,2460.63,500.35Q2460.63,500.35,2470.02,485.93L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '五棵松桥北站'      ,"_name":"wukesongqiaobeizhan"

  }, {
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '17号线燕郊线',
    'color': '#635FA8',
    'id': '27',
    'lineOl':'17',
    'stations': [{
    'start':'17',
    'sxy':'3350.02,490.63',
    'pxy':'3382.02,490.63',
    'ol':'1',
    'id': '143',
    'transfer': false,
    'xy': '3350.02,1260.63',
    'point_xy': '3310.02,1276.63',
    "draw_args": 'L3310.02,1276.63L3310.02,1176.63',
    'name': '东贸广场站'      ,"_name":"dongmaoguangchangzhan"

    }, {
    'ol':'2',
    'id': '142',
    'transfer': false,
    'xy': '3350.02,1176.63',
    'point_xy': '3310.02,1176.63',
    "draw_args": 'L3310.02,1176.63L3310.02,1076.63',
    'name': '交通干部管理学院'      ,"_name":"jiaotongganbuguanlixueyuan"

    }, {
    'ol':'3',
    'id': '141',
    'transfer': false,
    'xy': '3350.02,1076.63',
    'point_xy': '3310.02,1076.63',
    "draw_args": 'L3310.02,1076.63L3310.02,996.63',
    'name': '北京社会管理职业学院'      ,"_name":"beijingshehuiguanlizhiyexueyuan"

    },{
    'ol':'4',
    'id': '140',
    'transfer': false,
    'xy': '3350.02,996.63',
    'point_xy': '3310.02,996.63',
    "draw_args": 'L3310.02,996.63L3310.02,900.63',
    'name': '意华小区'      ,"_name":"yihuaxiaoqu"

    },{
    'ol':'5',
    'id': '139',
    'transfer': false,
    'xy': '3350.02,900.63',
    'point_xy': '3310.02,900.63',
    "draw_args": 'L3310.02,900.63L3310.02,816.63',
    'name': '燕京新城小区'      ,"_name":"yanjingxinchengxiaoqu"

    },{
    'ol':'6',
    'id': '138',
    'transfer': false,
    'xy': '3350.02,816.63',
    'point_xy': '3310.02,816.63',
    "draw_args": 'L3310.02,816.63L3310.02,716.63',//L2360.91,1686.63L2560.91,602.63
    'name': '星河皓月小区'      ,"_name":"xinghehaoyuexiaoqu"

    },{
    'ol':'7',
    'id': '137',
    'transfer': false,
    'xy': '3350.02,716.63',
    'point_xy': '3310.02,716.63',
    "draw_args": 'L3310.02,716.63L3310.02,600.63',//L2360.91,1686.63L2560.91,602.63
    'name': '美林小区',
      "_name":"meilinxiaoqu"

    },{
    'ol':'8',
    'id': '136',
    'transfer': false,
    'xy': '3350.02,600.63',
    'point_xy': '3310.02,600.63',
    "draw_args": 'L3310.02,600.63L3310.02,450.93Q3310.02,400.93,3108.5,260.34L3108.5,200.93Q3000.5,60.93,3015.5,100.34',//L2360.91,1686.63L2560.91,602.63
    'name': '首尔甜城站(诸葛店)',
      "_name":"shouertiancheng(zhugedian)"

    },{
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'name': '18号线昌平线',
  'color': '#674223',
  'id': '28',
  'lineOl':'18',
  'stations': [{
    'start':'18',
    'sxy':'1150.81,130',
    'pxy':'1180.81,150',
    'ol':'1',
    'id': '148',
    'transfer': false,
    'xy': '1220.81,100',
    'point_xy': '1250.81,150',
    "draw_args": 'L1250.81,150L1550.81,150',
    'name': '昌平北站'      ,"_name":"changpingbeizhan"

  },{
    'ol':'2',
    'id': '147',
    'transfer': false,
    'xy': '1400.81,100',
    'point_xy': '1550.81,150',
    "draw_args": 'L1550.81,150L1850.81,150',
    'name': '昌平中心公园站'      ,"_name":"changpingzhongxingongyuanzhan"

  },{
    'ol':'3',
    'id': '146',
    'transfer': false,
    'xy': '1770.81,100',
    'point_xy': '1850.81,150',
    "draw_args": 'L1850.81,150L2150.81,150',
    'name': '水关新村北站'      ,"_name":"shuiguanxincunbeizhan"

  },{
    'ol':'4',
    'id': '145',
    'transfer': false,
    'xy': '2090.81,100',
    'point_xy': '2150.81,150',
    "draw_args": 'L2150.81,150L2500.81,150',
    'name': '京科苑东站'      ,"_name":"jingkeyuandongzhan"

  },{
    'ol':'6',
    'id': '144',
    'transfer': false,
    'xy': '2480.81,100',
    'point_xy': '2500.81,150',
    "draw_args": 'L2500.81,150L2650.81,150L2956.87,221.42Q2966.87,226.42,2985.87,215.42Q2999.035,180.7650000000001,3010.02,100.93',
    'name': '北控科技大厦站'      ,"_name":"beikongkejidashazhan"

  },{
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
},{
  'night':'night',
  'name': '夜航西单线',
  'color': '#FFC72C',
  'id': '29',
  'lineOl':'19',
  'stations': [{
    'start':'19',
    'sxy':'2081.81,1330.23',
    'ol':'1',
    'id': '149',
    'transfer': false,
    'xy': '2029.81,1300.23',
    'point_xy': '2139.81,1300.23',
    "draw_args": 'L2139.81,1300.23L2139.81,1200.23L2250.81,1200.23',//Q1426.2800000000007,1185.5899999999999,1426.28,1164.27Q1426.2800000000007,1085.5899999999999,1316.89,964.27Q1306.89,954,1309.89,850.27L1309.89,780
    'name': '三元桥站'      ,"_name":"sanyuanqiaozhan"

  },{
    'ol':'2',
    'id': '150',
    'name': '东直门站'      ,"_name":"dongzhimenzhan"

  },{
    'ol':'3',
    'id': '151',
    'name': '东四十条站'      ,"_name":"dongsishitiaozhan"

  },{
    'ol':'4',
    'id': '152',
    'name': '朝阳门站'      ,"_name":"chaoyangmenzhan"

  },{
    'ol':'5',
    'id': '153',
    'name': '雅宝路站'      ,"_name":"yabaoluzhan"

  },{
    'ol':'6',
    'id': '154',
    'name': '北京站'      ,"_name":"beijingzhan"

  },{
    'ol':'7',
    'id': '155',
    'name': '国际饭店站'      ,"_name":"guojifandianzhan"

  },{
    'ol':'8',
    'id': '156',
    'name': '西单站'      ,"_name":"xidanzhan"

  },{
    'ol':'100000',
    'id': '62',
    'xy': '3045.5,100.34',
    'point_xy': '3010.02,100.93',
    'draw_args': '',
    'name': '首都机场'
  }]
}]
